benchmark/output/semoptimizacoes/0_22-Jul-2014-03:11:59-1-100-16.out
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.0.100 (be patient).....done


Server Software:        Apache/2.2.15
Server Hostname:        192.168.0.100
Server Port:            80

Document Path:          /BillMate/dashboard/user
Document Length:        522106 bytes

Concurrency Level:      16
Time taken for tests:   82.189 seconds
Complete requests:      100
Failed requests:        0
Write errors:           0
Keep-Alive requests:    0
Total transferred:      52227700 bytes
HTML transferred:       52210600 bytes
Requests per second:    1.22 [#/sec] (mean)
Time per request:       13150.163 [ms] (mean)
Time per request:       821.885 [ms] (mean, across all concurrent requests)
Transfer rate:          620.57 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        1    3   2.6      2      19
Processing:  7589 12537 2035.2  12767   19730
Waiting:     7500 12087 1785.2  12526   19195
Total:       7592 12540 2035.0  12768   19732

Percentage of the requests served within a certain time (ms)
  50%  12768
  66%  13107
  75%  13315
  80%  13554
  90%  15737
  95%  15809
  98%  19124
  99%  19732
 100%  19732 (longest request)