benchmark/output/semoptimizacoes/1_22-Jul-2014-03:21:12-2-500-16.out
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.0.100 (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Finished 500 requests


Server Software:        Apache/2.2.15
Server Hostname:        192.168.0.100
Server Port:            80

Document Path:          /BillMate/dashboard/user
Document Length:        1740 bytes

Concurrency Level:      16
Time taken for tests:   411.645 seconds
Complete requests:      500
Failed requests:        499
   (Connect: 0, Receive: 0, Length: 499, Exceptions: 0)
Write errors:           0
Non-2xx responses:      1
Keep-Alive requests:    0
Total transferred:      260618128 bytes
HTML transferred:       260532634 bytes
Requests per second:    1.21 [#/sec] (mean)
Time per request:       13172.640 [ms] (mean)
Time per request:       823.290 [ms] (mean, across all concurrent requests)
Transfer rate:          618.28 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        1    3   3.6      2      23
Processing:   149 13070 2490.0  12758   25990
Waiting:      149 12439 1564.5  12470   20841
Total:        162 13073 2489.9  12766   25992

Percentage of the requests served within a certain time (ms)
  50%  12766
  66%  13130
  75%  13421
  80%  13658
  90%  14351
  95%  17060
  98%  25150
  99%  25722
 100%  25992 (longest request)